susanw1/zscript/receivers/generic-c++/zll/arm/implementations/src/main/c++/stm32/AlternateFunction/STM32F469.h
#define FMC_A0_PF0_ PF0,GPIO_AF12
#define _FMC_A0_PF0_ 1

#define FMC_A1_PF1_ PF1,GPIO_AF12
#define _FMC_A1_PF1_ 1

#define FMC_A10_PG0_ PG0,GPIO_AF12
#define _FMC_A10_PG0_ 1

#define FMC_A11_PG1_ PG1,GPIO_AF12
#define _FMC_A11_PG1_ 1

#define FMC_A12_PG2_ PG2,GPIO_AF12
#define _FMC_A12_PG2_ 1

#define FMC_A13_PG3_ PG3,GPIO_AF12
#define _FMC_A13_PG3_ 1

#define FMC_A14_PG4_ PG4,GPIO_AF12
#define _FMC_A14_PG4_ 1

#define FMC_A15_PG5_ PG5,GPIO_AF12
#define _FMC_A15_PG5_ 1

#define FMC_A16_PD11_ PD11,GPIO_AF12
#define _FMC_A16_PD11_ 1

#define FMC_A17_PD12_ PD12,GPIO_AF12
#define _FMC_A17_PD12_ 1

#define FMC_A18_PD13_ PD13,GPIO_AF12
#define _FMC_A18_PD13_ 1

#define FMC_A19_PE3_ PE3,GPIO_AF12
#define _FMC_A19_PE3_ 1

#define FMC_A2_PF2_ PF2,GPIO_AF12
#define _FMC_A2_PF2_ 1

#define FMC_A20_PE4_ PE4,GPIO_AF12
#define _FMC_A20_PE4_ 1

#define FMC_A21_PE5_ PE5,GPIO_AF12
#define _FMC_A21_PE5_ 1

#define FMC_A22_PE6_ PE6,GPIO_AF12
#define _FMC_A22_PE6_ 1

#define FMC_A23_PE2_ PE2,GPIO_AF12
#define _FMC_A23_PE2_ 1

#define FMC_A24_PG13_ PG13,GPIO_AF12
#define _FMC_A24_PG13_ 1

#define FMC_A25_PG14_ PG14,GPIO_AF12
#define _FMC_A25_PG14_ 1

#define FMC_A3_PF3_ PF3,GPIO_AF12
#define _FMC_A3_PF3_ 1

#define FMC_A4_PF4_ PF4,GPIO_AF12
#define _FMC_A4_PF4_ 1

#define FMC_A5_PF5_ PF5,GPIO_AF12
#define _FMC_A5_PF5_ 1

#define FMC_A6_PF12_ PF12,GPIO_AF12
#define _FMC_A6_PF12_ 1

#define FMC_A7_PF13_ PF13,GPIO_AF12
#define _FMC_A7_PF13_ 1

#define FMC_A8_PF14_ PF14,GPIO_AF12
#define _FMC_A8_PF14_ 1

#define FMC_A9_PF15_ PF15,GPIO_AF12
#define _FMC_A9_PF15_ 1

#define FMC_ALE_PD12_ PD12,GPIO_AF12
#define _FMC_ALE_PD12_ 1

#define FMC_BA0_PG4_ PG4,GPIO_AF12
#define _FMC_BA0_PG4_ 1

#define FMC_BA1_PG5_ PG5,GPIO_AF12
#define _FMC_BA1_PG5_ 1

#define FMC_CLE_PD11_ PD11,GPIO_AF12
#define _FMC_CLE_PD11_ 1

#define FMC_CLK_PD3_ PD3,GPIO_AF12
#define _FMC_CLK_PD3_ 1

#define FMC_D0_PD14_ PD14,GPIO_AF12
#define _FMC_D0_PD14_ 1

#define FMC_D1_PD15_ PD15,GPIO_AF12
#define _FMC_D1_PD15_ 1

#define FMC_D10_PE13_ PE13,GPIO_AF12
#define _FMC_D10_PE13_ 1

#define FMC_D11_PE14_ PE14,GPIO_AF12
#define _FMC_D11_PE14_ 1

#define FMC_D12_PE15_ PE15,GPIO_AF12
#define _FMC_D12_PE15_ 1

#define FMC_D13_PD8_ PD8,GPIO_AF12
#define _FMC_D13_PD8_ 1

#define FMC_D14_PD9_ PD9,GPIO_AF12
#define _FMC_D14_PD9_ 1

#define FMC_D15_PD10_ PD10,GPIO_AF12
#define _FMC_D15_PD10_ 1

#define FMC_D16_PH8_ PH8,GPIO_AF12
#define _FMC_D16_PH8_ 1

#define FMC_D17_PH9_ PH9,GPIO_AF12
#define _FMC_D17_PH9_ 1

#define FMC_D18_PH10_ PH10,GPIO_AF12
#define _FMC_D18_PH10_ 1

#define FMC_D19_PH11_ PH11,GPIO_AF12
#define _FMC_D19_PH11_ 1

#define FMC_D2_PD0_ PD0,GPIO_AF12
#define _FMC_D2_PD0_ 1

#define FMC_D20_PH12_ PH12,GPIO_AF12
#define _FMC_D20_PH12_ 1

#define FMC_D21_PH13_ PH13,GPIO_AF12
#define _FMC_D21_PH13_ 1

#define FMC_D22_PH14_ PH14,GPIO_AF12
#define _FMC_D22_PH14_ 1

#define FMC_D23_PH15_ PH15,GPIO_AF12
#define _FMC_D23_PH15_ 1

#define FMC_D24_PI0_ PI0,GPIO_AF12
#define _FMC_D24_PI0_ 1

#define FMC_D25_PI1_ PI1,GPIO_AF12
#define _FMC_D25_PI1_ 1

#define FMC_D26_PI2_ PI2,GPIO_AF12
#define _FMC_D26_PI2_ 1

#define FMC_D27_PI3_ PI3,GPIO_AF12
#define _FMC_D27_PI3_ 1

#define FMC_D28_PI6_ PI6,GPIO_AF12
#define _FMC_D28_PI6_ 1

#define FMC_D29_PI7_ PI7,GPIO_AF12
#define _FMC_D29_PI7_ 1

#define FMC_D3_PD1_ PD1,GPIO_AF12
#define _FMC_D3_PD1_ 1

#define FMC_D30_PI9_ PI9,GPIO_AF12
#define _FMC_D30_PI9_ 1

#define FMC_D31_PI10_ PI10,GPIO_AF12
#define _FMC_D31_PI10_ 1

#define FMC_D4_PE7_ PE7,GPIO_AF12
#define _FMC_D4_PE7_ 1

#define FMC_D5_PE8_ PE8,GPIO_AF12
#define _FMC_D5_PE8_ 1

#define FMC_D6_PE9_ PE9,GPIO_AF12
#define _FMC_D6_PE9_ 1

#define FMC_D7_PE10_ PE10,GPIO_AF12
#define _FMC_D7_PE10_ 1

#define FMC_D8_PE11_ PE11,GPIO_AF12
#define _FMC_D8_PE11_ 1

#define FMC_D9_PE12_ PE12,GPIO_AF12
#define _FMC_D9_PE12_ 1

#define FMC_DA0_PD14_ PD14,GPIO_AF12
#define _FMC_DA0_PD14_ 1

#define FMC_DA1_PD15_ PD15,GPIO_AF12
#define _FMC_DA1_PD15_ 1

#define FMC_DA10_PE13_ PE13,GPIO_AF12
#define _FMC_DA10_PE13_ 1

#define FMC_DA11_PE14_ PE14,GPIO_AF12
#define _FMC_DA11_PE14_ 1

#define FMC_DA12_PE15_ PE15,GPIO_AF12
#define _FMC_DA12_PE15_ 1

#define FMC_DA13_PD8_ PD8,GPIO_AF12
#define _FMC_DA13_PD8_ 1

#define FMC_DA14_PD9_ PD9,GPIO_AF12
#define _FMC_DA14_PD9_ 1

#define FMC_DA15_PD10_ PD10,GPIO_AF12
#define _FMC_DA15_PD10_ 1

#define FMC_DA2_PD0_ PD0,GPIO_AF12
#define _FMC_DA2_PD0_ 1

#define FMC_DA3_PD1_ PD1,GPIO_AF12
#define _FMC_DA3_PD1_ 1

#define FMC_DA4_PE7_ PE7,GPIO_AF12
#define _FMC_DA4_PE7_ 1

#define FMC_DA5_PE8_ PE8,GPIO_AF12
#define _FMC_DA5_PE8_ 1

#define FMC_DA6_PE9_ PE9,GPIO_AF12
#define _FMC_DA6_PE9_ 1

#define FMC_DA7_PE10_ PE10,GPIO_AF12
#define _FMC_DA7_PE10_ 1

#define FMC_DA8_PE11_ PE11,GPIO_AF12
#define _FMC_DA8_PE11_ 1

#define FMC_DA9_PE12_ PE12,GPIO_AF12
#define _FMC_DA9_PE12_ 1

#define FMC_INT_PG7_ PG7,GPIO_AF12
#define _FMC_INT_PG7_ 1

#define FMC_NBL0_PE0_ PE0,GPIO_AF12
#define _FMC_NBL0_PE0_ 1

#define FMC_NBL1_PE1_ PE1,GPIO_AF12
#define _FMC_NBL1_PE1_ 1

#define FMC_NBL2_PI4_ PI4,GPIO_AF12
#define _FMC_NBL2_PI4_ 1

#define FMC_NBL3_PI5_ PI5,GPIO_AF12
#define _FMC_NBL3_PI5_ 1

#define FMC_NCE_PG9_ PG9,GPIO_AF12
#define _FMC_NCE_PG9_ 1

#define FMC_NE1_PD7_ PD7,GPIO_AF12
#define _FMC_NE1_PD7_ 1

#define FMC_NE2_PG9_ PG9,GPIO_AF12
#define _FMC_NE2_PG9_ 1

#define FMC_NE3_PG10_ PG10,GPIO_AF12
#define _FMC_NE3_PG10_ 1

#define FMC_NE4_PG12_ PG12,GPIO_AF12
#define _FMC_NE4_PG12_ 1

#define FMC_NL_PB7_ PB7,GPIO_AF12
#define _FMC_NL_PB7_ 1

#define FMC_NOE_PD4_ PD4,GPIO_AF12
#define _FMC_NOE_PD4_ 1

#define FMC_NWAIT_PD6_ PD6,GPIO_AF12
#define _FMC_NWAIT_PD6_ 1

#define FMC_NWE_PD5_ PD5,GPIO_AF12
#define _FMC_NWE_PD5_ 1

#define FMC_SDCKE0_PC3_ PC3,GPIO_AF12
#define FMC_SDCKE0_PC5_ PC5,GPIO_AF12
#define FMC_SDCKE0_PH2_ PH2,GPIO_AF12
#define _FMC_SDCKE0_PC3_ 1
#define _FMC_SDCKE0_PC5_ 1
#define _FMC_SDCKE0_PH2_ 1

#define FMC_SDCKE1_PB5_ PB5,GPIO_AF12
#define FMC_SDCKE1_PH7_ PH7,GPIO_AF12
#define _FMC_SDCKE1_PB5_ 1
#define _FMC_SDCKE1_PH7_ 1

#define FMC_SDCLK_PG8_ PG8,GPIO_AF12
#define _FMC_SDCLK_PG8_ 1

#define FMC_SDNCAS_PG15_ PG15,GPIO_AF12
#define _FMC_SDNCAS_PG15_ 1

#define FMC_SDNE0_PC2_ PC2,GPIO_AF12
#define FMC_SDNE0_PC4_ PC4,GPIO_AF12
#define FMC_SDNE0_PH3_ PH3,GPIO_AF12
#define _FMC_SDNE0_PC2_ 1
#define _FMC_SDNE0_PC4_ 1
#define _FMC_SDNE0_PH3_ 1

#define FMC_SDNE1_PB6_ PB6,GPIO_AF12
#define FMC_SDNE1_PH6_ PH6,GPIO_AF12
#define _FMC_SDNE1_PB6_ 1
#define _FMC_SDNE1_PH6_ 1

#define FMC_SDNRAS_PF11_ PF11,GPIO_AF12
#define _FMC_SDNRAS_PF11_ 1

#define FMC_SDNWE_PA7_ PA7,GPIO_AF12
#define FMC_SDNWE_PC0_ PC0,GPIO_AF12
#define FMC_SDNWE_PH5_ PH5,GPIO_AF12
#define _FMC_SDNWE_PA7_ 1
#define _FMC_SDNWE_PC0_ 1
#define _FMC_SDNWE_PH5_ 1

#define I2C1_SCL_PB6_ PB6,GPIO_AF4
#define I2C1_SCL_PB8_ PB8,GPIO_AF4
#define _I2C1_SCL_PB6_ 1
#define _I2C1_SCL_PB8_ 1

